In [1]:
import pandas as pd
import pymysql

In [2]:
connection = pymysql.connect(host='localhost',user='root',database='db_pandas',port = 3306, autocommit=True)

In [3]:
connection

In [4]:
curr = connection.cursor()

In [8]:
query = "select * from employees"
pd.read_sql(query,connection)

    id   name  sal designation location
0  101    Ram    5   Developer     Pune
1  102  Manoj    7   Developer     Pune
2  103  Mansi    5          HR    Delhi
3  104   Aman    8     Manager    Noida
4  105  Kunal   10   Architect    Noida